espressif/esp-idf/components/soc/esp32p4/include/soc/spi1_mem_s_struct.h
typedef struct {
    volatile spi_mem_cmd_reg_t cmd;
    volatile spi_mem_addr_reg_t addr;
    volatile spi_mem_ctrl_reg_t ctrl;
    volatile spi_mem_ctrl1_reg_t ctrl1;
    volatile spi_mem_ctrl2_reg_t ctrl2;
    volatile spi_mem_clock_reg_t clock;
    volatile spi_mem_user_reg_t user;
    volatile spi_mem_user1_reg_t user1;
    volatile spi_mem_user2_reg_t user2;
    volatile spi_mem_mosi_dlen_reg_t mosi_dlen;
    volatile spi_mem_miso_dlen_reg_t miso_dlen;
    volatile spi_mem_rd_status_reg_t rd_status;
    uint32_t reserved_030;
    volatile spi_mem_misc_reg_t misc;
    volatile spi_mem_tx_crc_reg_t tx_crc;
    volatile spi_mem_cache_fctrl_reg_t cache_fctrl;
    uint32_t reserved_040[6];
    volatile spi_mem_w0_reg_t w0;
    volatile spi_mem_w1_reg_t w1;
    volatile spi_mem_w2_reg_t w2;
    volatile spi_mem_w3_reg_t w3;
    volatile spi_mem_w4_reg_t w4;
    volatile spi_mem_w5_reg_t w5;
    volatile spi_mem_w6_reg_t w6;
    volatile spi_mem_w7_reg_t w7;
    volatile spi_mem_w8_reg_t w8;
    volatile spi_mem_w9_reg_t w9;
    volatile spi_mem_w10_reg_t w10;
    volatile spi_mem_w11_reg_t w11;
    volatile spi_mem_w12_reg_t w12;
    volatile spi_mem_w13_reg_t w13;
    volatile spi_mem_w14_reg_t w14;
    volatile spi_mem_w15_reg_t w15;
    volatile spi_mem_flash_waiti_ctrl_reg_t flash_waiti_ctrl;
    volatile spi_mem_flash_sus_ctrl_reg_t flash_sus_ctrl;
    volatile spi_mem_flash_sus_cmd_reg_t flash_sus_cmd;
    volatile spi_mem_sus_status_reg_t sus_status;
    uint32_t reserved_0a8[6];
    volatile spi_mem_int_ena_reg_t int_ena;
    volatile spi_mem_int_clr_reg_t int_clr;
    volatile spi_mem_int_raw_reg_t int_raw;
    volatile spi_mem_int_st_reg_t int_st;
    uint32_t reserved_0d0;
    volatile spi_mem_ddr_reg_t ddr;
    uint32_t reserved_0d8[42];
    volatile spi_mem_timing_cali_reg_t timing_cali;
    uint32_t reserved_184[31];
    volatile spi_mem_clock_gate_reg_t clock_gate;
    uint32_t reserved_204[126];
    volatile spi_mem_date_reg_t date;
} spi1_mem_s_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(spi_mem_dev_t) == 0x400, "Invalid size of spi_mem_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
